{
  "backend/main.mo": "Motoko canister managing user cards with access control, card creation, retrieval, and sale price updates using Map and List storage.",
  "feature_evidence.json": "Machine‑generated report mapping features to affected files, components, and test IDs with high-confidence evidence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing frontend components, hooks, and pages for reference or documentation.",
  "frontend/index.css": "Tailwind base theme defining OKLCH color variables for light and dark modes and global styling.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Main React app handling early token extraction, Internet Identity auth, actor initialization with timeouts, profile loading, and UI error handling.",
  "frontend/src/components/AddCardDialog.tsx": "Dialog form allowing users to add cards with free-text rarity, autocomplete suggestions, validation, and mutation to backend.",
  "frontend/src/components/AutocompleteTextInput.tsx": "Autocomplete text input with filtered suggestions, click-outside closing, and optional placeholder and required flag.",
  "frontend/src/components/CardItem.tsx": "Displays a card with rarity styling, pricing, and actions to edit, sell/trade, or delete using related dialogs.",
  "frontend/src/components/CraftedCardsModal.tsx": "Modal listing crafted cards with rarity badges, purchase info, and details like country, league, and position.",
  "frontend/src/components/EditCardDialog.tsx": "Dialog for editing card fields, validating input, and submitting updates via updateCard mutation.",
  "frontend/src/components/ErrorBoundary.tsx": "Catches render errors and shows a detailed alert with optional stack trace and a reload button.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright, a heart icon, and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with app title, user greeting, and login/logout button using Internet Identity auth.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal forcing initial profile setup by collecting and saving the user's name.",
  "frontend/src/components/SellOrTradeDialog.tsx": "Component providing a dialog to sell, trade, or add cards with rarity styling and form handling logic.",
  "frontend/src/components/SoldCardsModal.tsx": "Modal showing sold and traded cards with profit/loss calculations and expandable trade details.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing an authenticated or anonymous backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useActorQueryState.ts": "Hook exposing React Query state for actor initialization with helpers for detecting errors and retrying.",
  "frontend/src/hooks/useGoogleAuth.ts": "Empty file with no implemented logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provider and hooks for managing Internet Identity login, stored identity loading, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, cards, and related backend data.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining color themes for light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React Query, InternetIdentityProvider, and rendering the root application.",
  "frontend/src/pages/CardsPage.tsx": "Displays user cards with search and multiple filters, generating filter options from card data and rendering filtered results. Also provides a dialog for adding new cards.",
  "frontend/src/pages/PortfolioPage.tsx": "Aggregates and displays investment, return, and transaction statistics, including sold and crafted card summaries. Loads multiple metrics, computes profit/loss, and renders portfolio overview UI with modals.",
  "frontend/src/utils/cardSuggestions.ts": "Generates unique field-based suggestions from cards and filters them by user input. Provides helpers for country, league, club, and season suggestions.",
  "frontend/src/utils/redactSecrets.ts": "Redacts sensitive values from strings and errors, including query parameters and sessionStorage references. Provides utilities to safely sanitize error output.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and persisting URL parameters across navigation, including hash-based routes. Includes helpers for sessionStorage persistence and clearing parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins including typography, container queries, and animate. Extends UI tokens and layout rules for the application.",
  "project_state.json": "Describes project metadata, known issues, and existing feature requirements related to URL token handling and backend connection errors."
}