{
  "backend/main.mo": "Motoko canister managing user cards with access control, storage mixins, card creation, retrieval, and sale‑price updates.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key behaviors and responsibilities of all major frontend files.",
  "frontend/index.css": "Tailwind CSS base definitions with OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app managing authentication, actor initialization, profile loading, timeout handling, and layout structure.",
  "frontend/src/components/AddCardDialog.tsx": "Dialog for adding cards with free‑text rarity, autocomplete fields, validation, and mutation to create new cards.",
  "frontend/src/components/AutocompleteTextInput.tsx": "Autocomplete input component that filters suggestions and displays a dropdown list, closing when clicking outside.",
  "frontend/src/components/CardItem.tsx": "Renders a card with rarity styling, price formatting, and actions for editing, selling, or deleting.",
  "frontend/src/components/CraftedCardsModal.tsx": "Modal showing crafted cards with rarity badges, formatted data, and purchase details.",
  "frontend/src/components/EditCardDialog.tsx": "Dialog for editing a card’s fields, syncing form state to the selected card and submitting updates.",
  "frontend/src/components/ErrorBoundary.tsx": "Error boundary that displays a fallback UI with error details and a reset option.",
  "frontend/src/components/Footer.tsx": "Simple footer with branding and external link attribution.",
  "frontend/src/components/Header.tsx": "Header with authentication controls, user greeting, and app title.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter and save a profile name on first use.",
  "frontend/src/components/SellOrTradeDialog.tsx": "Dialog component for selling or trading a card, with form inputs, rarity styling, and actions to mark cards as sold or record trades.",
  "frontend/src/components/SoldCardsModal.tsx": "Modal displaying sold and traded cards with profit/loss calculations, filtering, and expandable trade details.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, refreshing queries when identity changes.",
  "frontend/src/hooks/useGoogleAuth.ts": "Empty placeholder file for Google authentication hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading/storing identities and exposing login and logout actions.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles, cards, transactions, and mutations communicating with the backend actor.",
  "frontend/src/index.css": "Tailwind CSS base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React, Internet Identity provider, React Query, and global styles.",
  "frontend/src/pages/CardsPage.tsx": "CardsPage loads user cards, builds filter options, applies multiple filters, and displays filtered card items with an add-card dialog.",
  "frontend/src/pages/PortfolioPage.tsx": "PortfolioPage aggregates investment metrics, transaction statistics, and sold/crafted card data, rendering a detailed portfolio dashboard with modal views.",
  "frontend/src/utils/cardSuggestions.ts": "Provides utilities to extract unique card field values and filter them for autocomplete suggestions.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind config defining theme extensions, colors, animations, and enabled plugins for the frontend.",
  "project_state.json": "Project metadata describing current features, issues, and pending requests for UI cleanup and performance improvements."
}