{
  "backend/main.mo": "Main canister logic defining card, user, and history types with access control, storage mixins, and functions for managing cards and change history.",
  "backend/migration.mo": "Migration module defining old/new actor state and a basic migration function copying data and adding a new backfillMarker map.",
  "feature_evidence.json": "Feature evidence report linking a specific history-page UI update to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their functionality across pages, hooks, and components.",
  "frontend/index.css": "Tailwind-based global style definitions using OKLCH variables for light and dark theme color systems.",
  "frontend/index.html": "Base HTML template mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Root application component handling authentication, actor initialization, timeouts, error states, and the main tabbed layout.",
  "frontend/src/components/AddCardDialog.tsx": "Dialog component for creating new cards with validation, autocomplete suggestions, and integration with the addCard mutation.",
  "frontend/src/components/AutocompleteTextInput.tsx": "Provides a text input with filtered autocomplete suggestions and outside-click handling.",
  "frontend/src/components/CardItem.tsx": "Renders a collectible card with rarity styling, pricing details, and actions for editing, selling, or deleting.",
  "frontend/src/components/CraftedCardsModal.tsx": "Displays crafted cards in a modal with rarity badges, purchase info, and metadata.",
  "frontend/src/components/EditCardDialog.tsx": "Modal form for editing a card’s fields, handling price, metadata, and date conversion.",
  "frontend/src/components/ErrorBoundary.tsx": "Catches and displays errors with technical details and a reload option.",
  "frontend/src/components/Footer.tsx": "Simple footer with a credit link and visual styling.",
  "frontend/src/components/Header.tsx": "Header with authentication controls and user profile display using Internet Identity.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter and save their name on first setup.",
  "frontend/src/components/SellOrTradeDialog.tsx": "Dialog component for selling or trading a card, including forms, state handling, and mutation calls to update backend data.",
  "frontend/src/components/SoldCardsModal.tsx": "Modal showing transaction history with tabs for sales and trades, calculating purchase/sale values and listing card details.",
  "frontend/src/hooks/queryKeys.ts": "Defines centralized React Query keys for user‑scoped data such as cards, profiles, transactions, and snapshots.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on user identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useActorQueryState.ts": "Provides access to React Query state for the actor initialization query, exposing status flags and a retry helper.",
  "frontend/src/hooks/useGoogleAuth.ts": "Empty placeholder hook file for Google authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, including identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data such as profiles, change history, and card operations.",
  "frontend/src/index.css": "TailwindCSS base and theme layer defining light and dark mode color variables and global styles.",
  "frontend/src/main.tsx": "Application entry point configuring React Query, Internet Identity provider, and rendering the root App component.",
  "frontend/src/pages/CardsPage.tsx": "Card list page with extensive filtering, search, and add-card dialog functionality.",
  "frontend/src/pages/HistoryPage.tsx": "Activity history page that loads change events, maps card IDs to names, and triggers backfill if empty.",
  "frontend/src/pages/PortfolioPage.tsx": "Portfolio summary page computing investment metrics, profits, and modal-driven transaction details.",
  "frontend/src/utils/cardSuggestions.ts": "Utility for extracting unique card field values and filtering suggestion lists.",
  "frontend/src/utils/formatTimestamp.ts": "Functions to format bigint timestamps into readable or relative time strings.",
  "frontend/src/utils/redactSecrets.ts": "Utilities that redact sensitive values from text and errors to prevent secret leakage.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom theme extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project state, including history-related feature requests, architectural notes, known issues, and metadata for the Sorare Portfolio project."
}