{
  "backend/main.mo": "Motoko canister managing user cards with access control, card CRUD logic, and storage mixins.",
  "feature_evidence.json": "Feature evidence listing affected frontend files and components for two feature tickets.",
  "frontend-file-summaries.txt": "Prewritten summaries describing behavior and responsibilities of each major frontend file.",
  "frontend/index.css": "Tailwind base definitions and OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app handling auth flow, actor initialization, profile loading, timeouts, and tabbed navigation UI.",
  "frontend/src/components/AddCardDialog.tsx": "React dialog for adding cards with validation, autocomplete suggestions, and submission via addCard mutation.",
  "frontend/src/components/AutocompleteTextInput.tsx": "Autocomplete text input with filtered suggestions, focus handling, and click-outside closing.",
  "frontend/src/components/CardItem.tsx": "Displays a card with rarity styling, purchase/sale info, and dialogs for editing, selling, or deleting.",
  "frontend/src/components/CraftedCardsModal.tsx": "Modal listing crafted cards with rarity badges, purchase details, and metadata fields.",
  "frontend/src/components/EditCardDialog.tsx": "Dialog for editing a card's details, handling form state and submitting updates.",
  "frontend/src/components/ErrorBoundary.tsx": "Catches UI errors and shows a detailed error message with reset functionality.",
  "frontend/src/components/Footer.tsx": "Simple footer showing attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with branding and authentication controls using Internet Identity.",
  "frontend/src/components/ProfileSetupModal.tsx": "Initial profile setup modal prompting the user to enter and save their name.",
  "frontend/src/components/SellOrTradeDialog.tsx": "Large dialog component for selling or trading cards, including forms for sale details and adding new cards with rarity and payment helpers.",
  "frontend/src/components/SoldCardsModal.tsx": "Modal displaying sold and traded cards, with profit/loss calculations and expandable trade groups.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useActorQueryState.ts": "Exposes query state for the actor initialization to allow UI error handling and manual retry.",
  "frontend/src/hooks/useGoogleAuth.ts": "Empty placeholder file for Google authentication logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, cards, and transactions using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables, themes, and global styles.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/CardsPage.tsx": "Page displaying user cards with extensive filtering options and an add-card dialog.",
  "frontend/src/pages/PortfolioPage.tsx": "Portfolio dashboard calculating totals, profits, and transaction metrics with modals for sold and crafted cards.",
  "frontend/src/utils/cardSuggestions.ts": "Utility functions generating unique card field suggestions and filtering them by user input.",
  "frontend/src/utils/redactSecrets.ts": "Helpers to redact sensitive values from text, errors, and logs.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, animations, and plugins.",
  "project_state.json": "Project state file tracking features, issues, and metadata."
}