{
  "backend/main.mo": "Motoko actor managing user cards with access control, card CRUD helpers, tracking card metadata, ownership, and storage integration.",
  "feature_evidence.json": "Feature evidence report linking frontend files to two actor‑initialization stability improvements with associated components and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all major frontend components, hooks, and pages.",
  "frontend/index.css": "Tailwind base theme defining OKLCH color tokens for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React root and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app handling auth, actor initialization, timeouts, error states, and routing between portfolio and cards views.",
  "frontend/src/components/AddCardDialog.tsx": "Dialog form for creating cards with validation, autocomplete suggestions, and backend mutation integration.",
  "frontend/src/components/AutocompleteTextInput.tsx": "Text input with dropdown suggestion filtering, outside-click closing, and selection handling.",
  "frontend/src/components/CardItem.tsx": "Displays a card with rarity styling, prices, actions, and dialogs for editing, selling, or deleting.",
  "frontend/src/components/CraftedCardsModal.tsx": "Modal listing crafted cards with rarity badges, metadata, and calculated purchase info.",
  "frontend/src/components/EditCardDialog.tsx": "Form dialog to edit card fields and submit updates via mutation.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary showing error details and a reload option.",
  "frontend/src/components/Footer.tsx": "Simple footer with copyright text and link attribution.",
  "frontend/src/components/Header.tsx": "Header with app title, user greeting, and login/logout handling using Internet Identity.",
  "frontend/src/components/ProfileSetupModal.tsx": "Always-open modal prompting users to enter and save their name on first setup.",
  "frontend/src/components/SellOrTradeDialog.tsx": "UI dialog for selling or trading a card, including form handling, rarity styling helpers, and interactions with card-related mutations.",
  "frontend/src/components/SoldCardsModal.tsx": "Modal that displays sold and traded cards with profit/loss calculations, grouping, and expandable trade details.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useActorQueryState.ts": "Exposes the query state of actor initialization to let components detect errors or retry actor setup.",
  "frontend/src/hooks/useGoogleAuth.ts": "Empty placeholder file for future Google authentication logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provider and hook for managing Internet Identity login state, identity loading, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, cards, transactions, and related backend data.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables for light and dark modes and applying base styles.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, and Internet Identity provider before rendering the app.",
  "frontend/src/pages/CardsPage.tsx": "Displays the user's cards with extensive filtering options and an add-card dialog, using memoized filter extraction and search.",
  "frontend/src/pages/PortfolioPage.tsx": "Shows portfolio metrics including investments, returns, balances, and transaction groups, with modals for sold and crafted cards.",
  "frontend/src/utils/cardSuggestions.ts": "Provides utilities to extract unique card field values and filter suggestion lists for autocomplete.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL and session parameters, supporting hash and query routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and layout utilities for the app.",
  "project_state.json": "Project metadata tracking current state, known issues, and features related to fixing login-related infinite loading."
}