{
  "backend/main.mo": "Main canister actor defining card, user, and history types with storage maps plus logging, ID generation, and history retrieval utilities.",
  "backend/migration.mo": "Migration module that mirrors the actor’s data structures and returns old state unchanged.",
  "feature_evidence.json": "Feature evidence report linking a history‑UI update feature to its relevant frontend file and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files for quick reference and build planning.",
  "frontend/index.css": "Tailwind base/theme file defining light and dark mode OKLCH color tokens and global styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication, actor initialization, profile loading timeouts, and tab-based navigation.",
  "frontend/src/components/AddCardDialog.tsx": "Dialog for adding cards with free-text rarity, autocomplete fields, validation, and submission to addCard mutation.",
  "frontend/src/components/AutocompleteTextInput.tsx": "Provides a text input with filtered suggestion dropdown and click-outside closing behavior.",
  "frontend/src/components/CardItem.tsx": "Renders a card entry with rarity styling, pricing info, and actions like edit, sell/trade, and delete.",
  "frontend/src/components/CraftedCardsModal.tsx": "Displays a modal listing crafted cards with rarity badges, metadata, and purchase details.",
  "frontend/src/components/EditCardDialog.tsx": "Modal form for editing card details, handling state reset and submission to update a card.",
  "frontend/src/components/ErrorBoundary.tsx": "Catches rendering errors and shows a recovery UI with technical details and reload option.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying attribution and link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with branding and authentication controls using Internet Identity.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter and save their profile name on first use.",
  "frontend/src/components/SellOrTradeDialog.tsx": "Dialog for selling a card or recording a trade, including form handling, card creation, and mutation calls.",
  "frontend/src/components/SoldCardsModal.tsx": "Modal displaying sales and trade history using transaction groups with tabbed navigation.",
  "frontend/src/hooks/queryKeys.ts": "Centralized factory generating consistent React Query keys scoped by principal.",
  "frontend/src/hooks/useActor.ts": "Hook that initializes and manages the backend actor, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useActorQueryState.ts": "Hook exposing the query state of actor initialization for UI error and retry handling.",
  "frontend/src/hooks/useGoogleAuth.ts": "Empty placeholder file for Google auth hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provider and hook managing Internet Identity authentication, session loading, and login state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for profiles, cards, history, trades, and related mutations using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS base/theme definitions and color variables for light and dark modes.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/CardsPage.tsx": "Displays user cards with extensive filtering, search, and dialog for adding cards.",
  "frontend/src/pages/HistoryPage.tsx": "Shows paginated change history with card name mapping, icons, and relative timestamps.",
  "frontend/src/pages/PortfolioPage.tsx": "Renders portfolio metrics, derived stats, and modals for sold and crafted card details.",
  "frontend/src/utils/cardSuggestions.ts": "Generates unique field-based suggestions from cards and filters them by user input.",
  "frontend/src/utils/formatTimestamp.ts": "Formats bigint timestamps into readable or relative time strings.",
  "frontend/src/utils/redactSecrets.ts": "Redacts sensitive parameter values from strings and errors for safe logging.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, animations, and containers, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project state metadata defining schema versions, existing features, and pending feature requests for the Sorare Portfolio project."
}