{
  "backend/main.mo": "Main actor implementing card management, user profiles, authorization mixins, and storage, including types and mutations for adding and retrieving user-owned cards.",
  "backend/migration.mo": "Defines legacy data structures and a no-op migration that returns existing card maps unchanged.",
  "feature_evidence.json": "Feature evidence report listing performance-related frontend changes, associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Collection of prewritten short summaries describing each frontend file’s functionality and recent enhancements.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point loading the React application root and main script.",
  "frontend/src/App.tsx": "Root React component handling authentication, actor initialization, profile loading, error states, and main tab-based navigation.",
  "frontend/src/components/AddCardDialog.tsx": "Modal form for creating a new card, handling state, suggestions, validation, and submission via useAddCard.",
  "frontend/src/components/AutocompleteTextInput.tsx": "Text input with dropdown autocomplete that filters suggestions and handles clicks outside to close.",
  "frontend/src/components/CardItem.tsx": "Displays a card with rarity styling, pricing info, and edit/sell/delete actions using dialogs.",
  "frontend/src/components/CraftedCardsModal.tsx": "Modal showing crafted cards with rarity badges, purchase details, and card metadata loaded from useGetCraftedCards.",
  "frontend/src/components/EditCardDialog.tsx": "Modal form for editing an existing card, preloading its fields and submitting updates via useUpdateCard.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that displays a styled error alert with technical details and a reload option.",
  "frontend/src/components/Footer.tsx": "Simple footer with attribution and external link styling.",
  "frontend/src/components/Header.tsx": "Header component handling Internet Identity login/logout and displaying user greeting.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting user to enter and save their profile name via mutation.",
  "frontend/src/components/SellOrTradeDialog.tsx": "Dialog for selling or trading a card with UI for pricing, rarity styles, and new card data inputs.",
  "frontend/src/components/SoldCardsModal.tsx": "Modal showing sold and traded cards with profit/loss calculations and expandable trade groups.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing the backend actor based on identity and invalidating related queries on change.",
  "frontend/src/hooks/useActorQueryState.ts": "Hook exposing query state for actor initialization and providing retry handling.",
  "frontend/src/hooks/useGoogleAuth.ts": "Empty placeholder file for Google Auth hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hooks for managing Internet Identity login, stored identities, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profile, cards, and transaction-related backend operations.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes, applying global border and body styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider, then renders the App component.",
  "frontend/src/pages/CardsPage.tsx": "Displays the user's cards with search and multi‑filter functionality and supports adding new cards via a dialog.",
  "frontend/src/pages/PortfolioPage.tsx": "Builds portfolio metrics from snapshot data, including investments, balances, and transaction counts, and shows modals for sold and crafted cards.",
  "frontend/src/utils/cardSuggestions.ts": "Provides helper functions to extract unique card attributes and filter suggestion lists.",
  "frontend/src/utils/redactSecrets.ts": "Redacts sensitive data in strings and errors, replacing tokens and secrets with placeholders.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters, including sessionStorage integration and hash‑based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radii, animations, and plugins using CSS variables for theming.",
  "project_state.json": "Contains project metadata, known performance issues, and a list of existing performance‑related feature items for the Sorare Portfolio project."
}