{
  "backend/main.mo": "Motoko canister implementing card management with access control, user‑scoped card storage, ID generation, and functions to add cards and query a user’s cards.",
  "feature_evidence.json": "Feature evidence report describing a frontend change adding a purchase‑total metric to the sold‑cards balance UI.",
  "frontend-file-summaries.txt": "Aggregated human‑written summaries of all major frontend files including pages, components, and hooks.",
  "frontend/index.css": "Tailwind base/theme definitions providing OKLCH color variables for light and dark modes.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component managing authentication, actor initialization, profile loading with timeouts, and rendering main pages or setup screens.",
  "frontend/src/components/AddCardDialog.tsx": "Dialog form for creating new cards with text inputs, suggestion‑based autocompletion, and submission via useAddCard.",
  "frontend/src/components/AutocompleteTextInput.tsx": "Reusable text input with dropdown suggestions, filtering, outside‑click handling, and selection behavior.",
  "frontend/src/components/CardItem.tsx": "Displays a card with rarity styling, pricing info, and actions for editing, selling/trading, or deleting.",
  "frontend/src/components/CraftedCardsModal.tsx": "Shows a modal listing crafted cards with rarity badges, purchase details, and card metadata.",
  "frontend/src/components/EditCardDialog.tsx": "Provides a form dialog to edit all card properties and submit updates to the backend.",
  "frontend/src/components/ErrorBoundary.tsx": "Catches UI errors and displays a recovery screen with optional technical details.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays the app header with branding and login/logout controls using Internet Identity.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter and save their profile name on first setup.",
  "frontend/src/components/SellOrTradeDialog.tsx": "Dialog for selling or trading a card, including sale input fields and adding new cards in trades.",
  "frontend/src/components/SoldCardsModal.tsx": "Modal component that displays sold and traded cards with profit calculations and expandable trade details.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useGoogleAuth.ts": "Empty placeholder for Google authentication hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login handling, stored identity loading, and an authentication provider component.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, cards, and related backend data via the actor.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for light and dark theme design tokens.",
  "frontend/src/main.tsx": "Application entry that sets up React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/CardsPage.tsx": "Page showing user cards with search, filtering, and an add-card dialog.",
  "frontend/src/pages/PortfolioPage.tsx": "Portfolio dashboard component loading investment, transaction, and card metrics, computing profit/loss and sold-card purchase totals, and rendering summary UI with modals.",
  "frontend/src/utils/cardSuggestions.ts": "Utility functions to extract unique card-field values and filter suggestions for country, league, club, and season.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from the hash for routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, layout, animations, and plugins for the frontend UI.",
  "project_state.json": "Project metadata tracking feature requests and issues related to sold-card balance and Essence purchase-cost handling."
}