{
  "backend/main.mo": "Motoko canister managing cards with access control, user profiles, and CRUD for card data including sales and trades.",
  "feature_evidence.json": "Feature evidence report linking implemented frontend files to feature IDs and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and behavior of all major frontend components and hooks.",
  "frontend/index.css": "Tailwind base theme defining OKLCH color variables and dark-mode overrides.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app handling identity, actor/profile loading with timeouts, retries, and page/tab rendering.",
  "frontend/src/components/AddCardDialog.tsx": "Dialog form for adding cards with free-text fields, autocomplete suggestions, and backend mutation integration.",
  "frontend/src/components/AutocompleteTextInput.tsx": "Reusable text input with filtered suggestion dropdown and outside-click handling.",
  "frontend/src/components/CardItem.tsx": "Displays a single card with rarity styling, price formatting, and actions for editing, selling, or deleting.",
  "frontend/src/components/CraftedCardsModal.tsx": "Modal that lists crafted cards with rarity badges, metadata, and purchase details pulled from backend queries.",
  "frontend/src/components/EditCardDialog.tsx": "Dialog for editing a card’s fields, syncing form state with the selected card and submitting updates.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that catches rendering errors and shows a reset option with technical details.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with branding and authentication controls integrating Internet Identity login state.",
  "frontend/src/components/ProfileSetupModal.tsx": "Always-open modal prompting new users to enter and save their display name.",
  "frontend/src/components/SellOrTradeDialog.tsx": "Dialog allowing users to sell a card or record a trade, including forms, rarity styling, and optional new card creation.",
  "frontend/src/components/SoldCardsModal.tsx": "React modal displaying sold and traded cards with profit/loss calculations and expandable trade details.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useGoogleAuth.ts": "Empty placeholder file for Google authentication logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login handling, and identity persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, cards, and mutations using the authenticated backend actor.",
  "frontend/src/index.css": "Tailwind CSS base setup with custom light/dark theme variables and global styling.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/CardsPage.tsx": "Cards page with filtering, search, and add-card dialog using user card data from backend queries.",
  "frontend/src/pages/PortfolioPage.tsx": "React page showing overall portfolio stats, loading multiple query hooks and rendering profit, transactions, and modals for sold and crafted cards.",
  "frontend/src/utils/cardSuggestions.ts": "Utility functions to extract unique card fields and filter suggestion lists.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session-based parameters, supporting hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project metadata describing current features, pending requests, and overall app purpose."
}