{
  "backend/main.mo": "Motoko canister defining card, user profile, and portfolio types with access control plus functions to add and retrieve user-specific cards.",
  "feature_evidence.json": "Feature evidence report linking frontend files to two state‑sync and UI‑update requirements with component metadata and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of multiple frontend source files for reference.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark OKLCH color palettes and global element styles.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app handling identity, actor initialization, profile loading timeouts, and rendering tabs for portfolio and cards.",
  "frontend/src/components/AddCardDialog.tsx": "Dialog form for adding a card with free‑text fields, autocomplete suggestions, and submission via useAddCard.",
  "frontend/src/components/AutocompleteTextInput.tsx": "A text input with filtered autocomplete suggestions and click-outside handling.",
  "frontend/src/components/CardItem.tsx": "Displays a card with rarity styling, pricing, actions, and dialogs for editing, selling, or deleting.",
  "frontend/src/components/CraftedCardsModal.tsx": "Modal showing crafted cards with rarity, metadata, and purchase info fetched from the backend.",
  "frontend/src/components/EditCardDialog.tsx": "Dialog form for editing card fields, handling sale values, dates, and updating via mutation.",
  "frontend/src/components/ErrorBoundary.tsx": "Catches UI errors and shows a reloadable error message with optional technical details.",
  "frontend/src/components/Footer.tsx": "Simple footer with attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with branding, user greeting, and login/logout handling via Internet Identity.",
  "frontend/src/components/ProfileSetupModal.tsx": "Always-open modal prompting new users to enter and save their name.",
  "frontend/src/components/SellOrTradeDialog.tsx": "Dialog component for selling or trading a card, including form handling, rarity styling helpers, and new-card creation logic.",
  "frontend/src/components/SoldCardsModal.tsx": "Modal for viewing sold and traded cards, including profit/loss calculations and expandable trade groups.",
  "frontend/src/hooks/queryKeys.ts": "Centralized factory for generating principal-scoped React Query keys.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches the backend actor based on Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useActorQueryState.ts": "Exposes React Query state for actor initialization with helper booleans and manual retry.",
  "frontend/src/hooks/useGoogleAuth.ts": "Empty placeholder hook file for Google authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, login flow, identity persistence, and provider component.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, cards, and related mutations using the backend actor.",
  "frontend/src/index.css": "Global Tailwind CSS configuration defining theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/CardsPage.tsx": "Displays the user's cards with extensive filtering options and an add-card dialog, using React Query data and memoized filter logic.",
  "frontend/src/pages/PortfolioPage.tsx": "Shows portfolio metrics derived from a snapshot query, includes transaction counts and modal views for sold and crafted cards.",
  "frontend/src/utils/cardSuggestions.ts": "Provides helper functions to extract unique card field values and generate filtered text suggestions for form inputs.",
  "frontend/src/utils/redactSecrets.ts": "Redacts sensitive values in strings and Error objects to prevent secret exposure in logs or UI.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing known issues, feature requests, and metadata for the Sorare Portfolio project."
}