{
  "kind": "build_request",
  "title": "Improve app performance and reduce long load times",
  "projectName": "Sorare Portfolio",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Reduce redundant React Query refetching to improve perceived performance, especially for cards loading.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Insgesamt soll alles flüssiger sein. Die ladezeiten sind teilweise sehr lange. Bitte beheben."
        ]
      },
      "acceptanceCriteria": [
        "Navigating between tabs (Portfolio/Cards) does not trigger an unconditional refetch of the cards list on every mount.",
        "The cards query uses a non-zero staleTime and does not use refetchOnMount='always' unless there is a clear reason documented in code comments.",
        "The Cards page shows previously cached cards immediately while a background refresh occurs (no blank state/spinner if cached data exists)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Reduce the number of backend calls needed to render the Portfolio page by introducing a single backend query that returns a portfolio summary/snapshot used by the UI.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Insgesamt soll alles flüssiger sein. Die ladezeiten sind teilweise sehr lange. Bitte beheben."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes one new query method that returns the Portfolio page’s required aggregates in one response (at minimum: totalInvested, totalReturns, investmentTotals, transactionSummary, soldCardBalance, craftedCardsCount, and (if needed by UI) transactionGroups).",
        "PortfolioPage no longer issues separate parallel queries for each aggregate; it uses the new single query (or at most one additional query when strictly necessary).",
        "On a cold load after login, the Portfolio page completes data loading with noticeably fewer network calls than before (verify by logging/Network panel: reduced from many calls to 1–2)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Tune React Query caching and invalidation strategy for portfolio-related data so mutations do not cause excessive refetch storms and long post-mutation loading states.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Insgesamt soll alles flüssiger sein. Die ladezeiten sind teilweise sehr lange. Bitte beheben."
        ]
      },
      "acceptanceCriteria": [
        "After add/update/delete/sell/trade mutations, the UI updates without triggering a full cascade of immediate refetches across many keys; invalidations are consolidated to the minimal set needed (preferably the new portfolio snapshot key plus userCards).",
        "Portfolio page does not block on refetching multiple independent queries after a mutation; loading indicators are scoped (e.g., sections) rather than a full-page spinner when possible.",
        "React Query keys remain stable and continue to be scoped per principal (no cross-user cache bleed)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure all user-facing loading/error text introduced or modified as part of these performance fixes is in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Use English for any user-facing text in the build request."
        ]
      },
      "acceptanceCriteria": [
        "Any newly added UI strings (loading states, error messages, helper text) are in English.",
        "If existing loading/error strings are modified during this work, the updated versions are in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn UI components are read-only).",
    "Do not edit immutable hook entrypoints listed in SYSTEM_CONTEXT (compose around them instead).",
    "Backend must remain a single Motoko actor in backend/main.mo; introduce backend/migration.mo only if state schema changes are required (avoid schema changes for performance work if possible)."
  ],
  "nonGoals": [
    "Adding new product features unrelated to performance (e.g., batch editing, new card fields, new authentication methods).",
    "Introducing external databases, third-party caching services, or non-supported backend stacks."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}