{
  "kind": "build_request",
  "title": "Fix infinite Connecting screen after login (actor init errors not surfaced)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Prevent the app from getting stuck on the \"Connecting…\" loading screen after a successful Internet Identity login by surfacing backend actor initialization failures (React Query error state) and providing a user-visible error state with recovery actions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Jetzt ist wieder das problem dass nach anmeldung der connceting screen mit dem ladekreis kommt, aber nichts passiert. Es lädt die ganze Zeit. Normalerweise sollte man nacch Anmeldung ins Portfolio gelangen"
        ]
      },
      "acceptanceCriteria": [
        "If actor creation fails (e.g., the useActor React Query enters an error state), the UI must not remain indefinitely on the \"Connecting…\" spinner.",
        "When actor creation fails, the UI must show an error message (English) indicating the backend connection failed, and provide a Retry action.",
        "Retry must trigger a new actor initialization attempt without requiring the user to manually refresh the page.",
        "A Log out action must remain available from the error state so the user can recover."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Update the actor initialization flow (useActor hook and App state machine) so that timeouts and errors are handled consistently: if actor initialization is neither successfully resolved nor actively fetching, the UI must transition away from the spinner to either a timeout state or an error state, rather than spinning forever.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "...nach anmeldung der connceting screen mit dem ladekreis kommt, aber nichts passiert. Es lädt die ganze Zeit."
        ]
      },
      "acceptanceCriteria": [
        "The \"Connecting…\" screen must only be shown while an actor initialization attempt is actively in progress.",
        "If the actor query stops fetching and has no actor available, the UI must not remain on the \"Connecting…\" screen.",
        "Actor timeout logic must not depend solely on isFetching in a way that allows indefinite loading when the query errors quickly.",
        "Manual QA: after login, the app reaches the main tabs view with Portfolio selected by default when actor initialization and profile loading succeed."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit immutable frontend hook files listed by the platform (e.g., frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts) unless the platform allows; if changes are needed, implement safe wrappers or adjustments in non-immutable files (e.g., App.tsx) and React Query usage patterns.",
    "All user-facing text introduced/changed by this request must be in English."
  ],
  "nonGoals": [
    "Do not add new authentication providers (only Internet Identity).",
    "Do not redesign the Portfolio/Cards features or change backend card/profile data models.",
    "Do not implement real-time updates or websocket-based connection handling."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}