{
  "kind": "build_request",
  "title": "Show add & sell events for all cards in History (with backfill for existing cards)",
  "projectName": "Sorare Portfolio",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Backfill change history so that the History page can show an entry for (a) adding a card and (b) selling a card for ALL existing cards, including cards created/sold before the history feature existed. This must be persisted so the backfill does not re-add duplicate entries on subsequent requests.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Die Historie soll das Hinzufügen und Verkauf aller Karten anzeigen. Also was als letztes von den 2 Sachen geändert wurde."
        ]
      },
      "acceptanceCriteria": [
        "If a user already has cards but their change history is empty or missing entries, fetching change history results includes at least one 'add card' entry for each existing card.",
        "If a user has cards whose current state indicates they are sold (e.g., transactionType == sold and saleDate/salePrice exist), fetching change history includes a corresponding 'sold' entry for each such card even if the sale happened before history logging existed.",
        "Backfilled entries are not duplicated across multiple calls to getChangeHistory (or across paging).",
        "Backfilled entries are ordered correctly by timestamp so the most recent of the two actions (Added vs Sold) appears as the latest event for that card when applicable."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure history entries for adding and selling a card include a clear, user-readable summary that identifies the card (preferably including both card id and card name).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Die Historie soll das Hinzufügen und Verkauf aller Karten anzeigen."
        ]
      },
      "acceptanceCriteria": [
        "Newly created cards generate an add-history entry with a summary that includes the card name and its id.",
        "Marking a card as sold generates a sold-history entry with a summary that includes the card name and its id."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the History page UI copy (English) and presentation so it clearly communicates that the view shows add/sell activity and is correctly refreshed after adding or selling cards.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Die Historie soll das Hinzufügen und Verkauf aller Karten anzeigen."
        ]
      },
      "acceptanceCriteria": [
        "All user-facing text related to the History page remains in English.",
        "After adding a card or marking a card as sold, the History page shows the corresponding new entry without requiring a hard refresh (React Query invalidation/refetch works).",
        "History entries for Add and Sold actions are visible and understandable to the user (label + summary + timestamp)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "If the backfill implementation introduces any new stable state fields (e.g., a per-user backfill marker), add/adjust the Motoko upgrade migration so existing canister state upgrades safely without data loss.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Auch die die vor Einbauen der Funktion gemacht wurden sollen angezeigt werden."
        ]
      },
      "acceptanceCriteria": [
        "Upgrading an existing deployed canister preserves existing cards, profiles, and existing change history entries.",
        "New state needed for backfill is initialized correctly on upgrade (no traps on first history fetch after upgrade)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional canisters/services).",
    "Do not modify files under frontend/src/components/ui (Shadcn components are read-only).",
    "Do not modify immutable frontend hook files listed in SYSTEM_CONTEXT (compose via new code elsewhere if needed)."
  ],
  "nonGoals": [
    "Do not implement a full field-by-field diff of edits (old value → new value) beyond what is required for add/sell events.",
    "Do not add third-party auth providers or external databases.",
    "Do not add real-time updates via WebSockets."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "User-facing text in build requests should be English."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}