{
  "kind": "build_request",
  "title": "Fix sold-card balance to exclude Essence purchase costs and display sold purchase total",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend sold-card balance calculation so that sold cards crafted/bought with the payment method `essence` do not subtract any purchase cost from the sold-card balance (i.e., treat their purchase cost as 0 in the sold-card balance calculation).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Karten die mit Essence gecraftet wurden sollen nur mit dem Verkaufspreis gewertet werden in der Verkaufsbilanz. Momentan wird der Kaufpreis mit Essence noch in die Rechnung mitinbegriffen, aber das soll nicht so sein."
        ]
      },
      "acceptanceCriteria": [
        "Calling `getSoldCardBalance()` for a user only subtracts discounted purchase costs for sold cards whose payment method is not `essence`.",
        "For sold cards with payment method `essence`, `getSoldCardBalance()` includes the sale price but subtracts 0 purchase cost.",
        "Existing behavior for non-Essence sold cards (cash/eth) remains unchanged, including discountPercent handling."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the \"Sold cards balance\" UI section (\"Bilanz verkaufter Karten\"), display an additional summary metric labeled \"Purchase total\" positioned to the left of the existing \"Sale proceeds\" metric, showing the sum of discounted purchase prices of all sold cards excluding any cards with payment method `essence` (Essence contributes 0 to this purchase total).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Bei „Bilanz verkaufter Karten“ sollen links neben „Verkaufserlöse“ noch „Kaufpreis“ stehen, bei dem die Summe der Kaufpreise der verkauften Karten steht."
        ]
      },
      "acceptanceCriteria": [
        "The \"Bilanz verkaufter Karten\" summary grid shows a new tile/row item labeled \"Purchase total\" placed immediately before (to the left of) the \"Sale proceeds\" tile on desktop layouts.",
        "\"Purchase total\" equals the sum over sold cards of `purchasePrice * (1 - discountPercent/100)` for non-Essence payment methods; sold cards with payment method `essence` contribute 0.",
        "The displayed purchase total is formatted as a euro amount with 2 decimals (e.g., €12.34).",
        "The sold-card balance value shown continues to match the backend `getSoldCardBalance()` result after REQ-1 is implemented."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Do not edit frontend files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Changing how overall portfolio totals (e.g., total invested across all cards) are calculated.",
    "Adding new filters or additional analytics beyond the requested purchase-total display and Essence exclusion rule.",
    "Changing the sold/trade transaction list presentation beyond what is necessary to support the requested totals."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}