{
  "kind": "build_request",
  "title": "Expand change history to fully track edits to existing cards",
  "projectName": "Sorare Portfolio",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Enhance backend change-history logging so edits to existing cards are fully traceable: when a card is edited or updated, the stored history entry summary must include which fields changed and the before/after values (for example: “Edited card #12 (Mbappé): purchasePrice 10.0 → 12.5, club PSG → Real Madrid”).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Ja bitte genauso"
        ]
      },
      "acceptanceCriteria": [
        "Updating a card via the existing updateCard flow produces a change history entry with action #editCard whose summary lists each changed field with old and new values.",
        "If no effective field values changed (user submits identical data), the history entry either is not created or clearly indicates 'No changes' (choose one behavior and keep it consistent).",
        "Existing ChangeHistoryEntry shape remains compatible with the current frontend usage (timestamp/action/cardIds/summary)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Enhance backend change-history summaries for other existing card modifications so they are self-explanatory and include before/after context where applicable (e.g., sale price changes should record oldSalePrice → newSalePrice; deleting a card should include the last known card name if available; marking as sold should include sale price and sale date/time).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Ist es möglich auch die Änderungen der bereits bestehenden Karten in der Historie anzuzeigen?"
        ]
      },
      "acceptanceCriteria": [
        "updateSalePrice history entries include both the previous and new sale price in the summary when a previous price existed.",
        "deleteCard history entries include the deleted card’s name in the summary when it can be determined at deletion time.",
        "markCardAsSold history entries include the sale price and a human-readable sale date/time in the summary (in addition to the entry timestamp)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the History page UI to display clearer, more informative entries for changes to existing cards by showing card names (not only IDs) wherever possible and by showing an explicit absolute date/time for each history entry in addition to the relative time already displayed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Ja bitte genauso"
        ]
      },
      "acceptanceCriteria": [
        "History list items show card name(s) next to card ID(s) when the card(s) still exist in the user’s collection (fallback to ID-only when not resolvable).",
        "Each history entry shows an absolute timestamp string in the UI (not only as a hover title), while keeping the existing relative-time display.",
        "The History page remains paginated/infinite-load as it is now (no regression to loading all entries at once)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Keep all Motoko backend logic inside the single actor in backend/main.mo; only add migration code if a state upgrade is strictly required."
  ],
  "nonGoals": [
    "Adding new third-party services or external databases.",
    "Real-time updates (WebSockets) for the history feed.",
    "Translating existing German UI text throughout the app (only the history improvements requested here)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}