{
  "kind": "build_request",
  "title": "Remove Age/Version inputs from card editor and speed up save/sell actions",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the \"Age\" and \"Version\" input fields from the card edit dialog UI, and ensure editing a card no longer requires the user to enter or validate those fields.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Wenn man eine Karte bearbeitet, soll dort auch nicht mehr „Version“ und „Alter“ als Eingabefeld geben."
        ]
      },
      "acceptanceCriteria": [
        "In the card edit dialog, there are no visible input controls labeled \"Age\" or \"Version\".",
        "The Save/Submit button validation does not depend on \"Age\" or \"Version\" being present or filled.",
        "Saving an edited card keeps the existing stored values for age and version unchanged (i.e., those properties are not cleared or overwritten unintentionally)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Improve perceived performance for \"Save\" after editing a card by preventing the UI from waiting on multiple sequential React Query invalidations/refetches before closing the dialog and showing success feedback.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Und wenn man Karte bearbeitet und dann speichert, dauert das Speichern sehr lange."
        ]
      },
      "acceptanceCriteria": [
        "After a successful update response from the backend, the edit dialog closes immediately (no delay caused by awaiting multiple query invalidations).",
        "Required data refreshes still happen in the background so the cards list/portfolio metrics update shortly after saving.",
        "No duplicate toasts or repeated refetch loops are introduced."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve perceived performance for \"Sell\" (mark card as sold) by preventing the UI from waiting on multiple sequential React Query invalidations/refetches before closing the dialog and showing success feedback.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Das gleiche bei „Verkaufen“ der Karte. Kann man das schneller machen?"
        ]
      },
      "acceptanceCriteria": [
        "After a successful \"mark as sold\" response from the backend, the sell dialog closes immediately (no delay caused by awaiting multiple query invalidations).",
        "The cards list and relevant portfolio/sold-card views update shortly after selling without requiring a manual refresh.",
        "No regression in error handling (errors still show toasts and leave the dialog open)."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui or any path listed in frontend.immutablePaths.",
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration code if state schema changes (not expected for this request)."
  ],
  "nonGoals": [
    "Do not remove the underlying age/version fields from the backend data model or existing stored cards.",
    "Do not redesign the sell/trade flow or change the trade feature behavior beyond performance improvements for selling.",
    "Do not introduce new authentication providers (Internet Identity remains the only auth)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}