{
  "kind": "build_request",
  "title": "Fix card deletion persistence and sync between Gallery and Portfolio",
  "projectName": "Sorare Portfolio",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix card deletion so that deleting a card is persisted in the backend and the deleted card does not reappear in the card gallery after a full page refresh.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Wenn man eine Karte löscht verschwindet sie aus der Kartengalerie aber im Portfolio verändert sich nichts. Bei Aktualisierung der Seite kommt die Karte wieder in die kartengalerie."
        ]
      },
      "acceptanceCriteria": [
        "After calling the backend delete operation for a card ID, subsequent calls to `getAllCardsForUser()` do not include that card.",
        "After a full browser refresh, the deleted card is still absent from the gallery because backend state no longer returns it.",
        "If a user attempts to delete a card ID that does not exist for them, the backend returns a clear error (no silent no-op)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the Portfolio UI updates immediately after a card is deleted from the gallery, using the same underlying data source as the gallery (React Query) and/or ensuring the portfolio snapshot query is reliably refetched/updated after deletion.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...aber im Portfolio verändert sich nichts... bitte behebe diese Fehler im Portfolio und Galerie."
        ]
      },
      "acceptanceCriteria": [
        "After deleting a card from the gallery, Portfolio totals/metrics that depend on cards update without requiring a manual page refresh.",
        "Deleting a card triggers a reliable refresh/update of any portfolio-related cached data (e.g., the portfolio snapshot query) for the active principal.",
        "No UI state shows the deleted card in any portfolio-derived lists or counts after deletion succeeds."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix gallery state synchronization so that the gallery reflects the backend as the source of truth after deletion, including correctly handling optimistic updates and ensuring the UI reconciles with the backend result.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Bei Aktualisierung der Seite kommt die Karte wieder in die kartengalerie. Das soll nicht so sein..."
        ]
      },
      "acceptanceCriteria": [
        "When a delete succeeds, the card remains removed from the gallery even after any automatic refetches complete.",
        "When a delete fails, the gallery rolls back to the previous state and displays an error message (existing toast behavior is acceptable).",
        "React Query cache keys used for optimistic updates, cancellation, and invalidation are consistent (including principal scoping) so gallery and portfolio cannot diverge."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` or any other paths listed as immutable in SYSTEM_CONTEXT.",
    "Backend must remain a single-actor Motoko canister; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Adding new portfolio features or new card fields.",
    "Changing authentication (Internet Identity) behavior.",
    "UI redesign beyond what is necessary to fix deletion-related inconsistencies."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}