{
  "kind": "build_request",
  "title": "Fix card deletion error and allow editing sale price in card editor",
  "projectName": "Card Portfolio",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the error that occurs when deleting a card from the card gallery so that the card is actually deleted and the UI remains stable (no uncaught errors / error overlays).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Beim löschen einer Karte aus der kartengalerie kommt eine Fehlermeldung. Die Karte soll gelöscht werden und die Änderungen im Portfolio übernommen werden."
        ]
      },
      "acceptanceCriteria": [
        "Deleting a card from the card gallery removes it from the cards list after the mutation completes.",
        "No frontend error boundary screen, console uncaught exception, or backend trap is triggered during/after deletion for a valid card.",
        "After deletion, any portfolio statistics that depend on the user’s cards reflect the deletion without requiring a manual page refresh (e.g., totals, transaction summary/groups, sold-card balance)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Extend the card edit dialog to allow changing the sale price when the card already has a sale price (i.e., salePrice is present), and ensure the portfolio metrics update accordingly after saving.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Außerdem soll man wenn man eine Karte bearbeitet auch den Verkaufspreis ändern können, falls es einen gibt. Die Änderungen ebenfalls im Portfolio aktualisieren."
        ]
      },
      "acceptanceCriteria": [
        "For cards with an existing salePrice, the edit dialog shows an editable sale price field prefilled with the current value.",
        "Saving edits persists the updated sale price in the backend (salePrice changes are reflected when reloading cards).",
        "After saving, the portfolio view reflects the updated sale price (e.g., total returns / sold-card balance) without requiring a manual refresh.",
        "For cards without an existing salePrice, the edit dialog does not show the sale price field (or clearly keeps it disabled/hidden)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not modify files under frontend/src/components/ui or any other paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding third-party authentication methods beyond Internet Identity.",
    "Introducing external databases or off-chain storage.",
    "Changing transaction type semantics (e.g., automatically marking cards sold when editing sale price) unless required to fix the deletion bug."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}