{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Surface actor initialization failures to avoid infinite Connecting screen",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Show a user-visible backend connection error state when actor initialization fails and provide Retry + Log out recovery actions.",
      "acceptanceCriteria": [
        "If actor creation fails (e.g., the useActor React Query enters an error state), the UI must not remain indefinitely on the \"Connecting…\" spinner.",
        "When actor creation fails, the UI must show an error message (English) indicating the backend connection failed, and provide a Retry action.",
        "Retry must trigger a new actor initialization attempt without requiring the user to manually refresh the page.",
        "A Log out action must remain available from the error state so the user can recover."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActorQueryState.ts",
          "operation": "create",
          "description": "Add a non-immutable wrapper hook that reads the React Query cache state for the actor query (status/error/fetchStatus) keyed by the current identity principal, so the UI can detect actor initialization failures and render an error state. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the authenticated \"Connecting…\" flow to consult the actor React Query error state (via the new wrapper hook) and render an English error screen when actor initialization fails, including Retry (triggers a new actor init attempt via React Query reset/refetch without window reload) and Log out actions. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Make actor initialization timeout/error handling consistent so the spinner only appears during an active attempt and never spins indefinitely when fetching stops without an actor.",
      "acceptanceCriteria": [
        "The \"Connecting…\" screen must only be shown while an actor initialization attempt is actively in progress.",
        "If the actor query stops fetching and has no actor available, the UI must not remain on the \"Connecting…\" screen.",
        "Actor timeout logic must not depend solely on isFetching in a way that allows indefinite loading when the query errors quickly.",
        "Manual QA: after login, the app reaches the main tabs view with Portfolio selected by default when actor initialization and profile loading succeed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Refactor the App actor-init state machine to derive UI states from the actor query's fetchStatus/status (in-progress vs error vs idle) instead of only checking !actor, ensuring: spinner shows only while actively fetching; a stopped-without-actor condition transitions to timeout or error; and the existing successful path continues to the main tabs with Portfolio selected by default. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useActorQueryState.ts",
          "operation": "modify",
          "description": "Extend the wrapper hook to expose the minimal derived booleans needed by App (e.g., isAttemptInProgress, isError, isIdleWithoutActor) so timeout logic can be implemented without modifying immutable hooks. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}