{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix secret token parsing, pre-login persistence, and backend connection error messaging",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix hash-based secret token parsing/clearing for caffeineAdminToken and persist it to sessionStorage.",
      "acceptanceCriteria": [
        "When the URL contains `#/anything?caffeineAdminToken=XYZ`, `getSecretParameter('caffeineAdminToken')` returns `XYZ` and stores it in sessionStorage.",
        "When the URL contains `#caffeineAdminToken=XYZ`, `getSecretParameter('caffeineAdminToken')` returns `XYZ` and stores it in sessionStorage.",
        "After extraction, the token is removed from the visible URL (hash) without reloading the page (existing behavior preserved).",
        "If no token is present, `getSecretParameter('caffeineAdminToken')` returns null and does not throw."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/urlParams.ts",
          "operation": "modify",
          "description": "Update secret extraction to support both hash-route query format (e.g. `#/route?caffeineAdminToken=...`) and pure hash query format (e.g. `#caffeineAdminToken=...`), persist found values to sessionStorage, and robustly remove only the secret from the visible hash (including when there is no `?` present)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Proactively extract/store caffeineAdminToken on initial app load so it survives Internet Identity redirects.",
      "acceptanceCriteria": [
        "On first render of the app (unauthenticated), the app attempts to extract `caffeineAdminToken` and store it in sessionStorage without showing any errors to the user.",
        "After completing Internet Identity login, backend actor initialization succeeds in live deployment when a valid `caffeineAdminToken` was present before redirect.",
        "If the token was not present, behavior remains unchanged (no crashes; existing error/timeout UI still works)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a mount-time effect that calls `getSecretParameter('caffeineAdminToken')` early (before any user login interaction) and swallows/logs any parsing errors without displaying UI errors; do not modify immutable auth/actor hook files."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Improve backend connection error UI to show readable, actionable English messaging while redacting sensitive secrets.",
      "acceptanceCriteria": [
        "If actor initialization fails, the UI shows an English error message with at least one actionable next step (e.g., retry, reload, log out/in).",
        "If an error message is available from the actor query, it is shown in the error details area (as today) but must not include any extracted URL/session secret values."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/redactSecrets.ts",
          "operation": "create",
          "description": "Create a small utility to redact sensitive values (at minimum `caffeineAdminToken`, from both query-like fragments and arbitrary strings) from error messages before rendering them to the UI."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the actor-initialization failure/timeout UI copy to clear, user-readable English with suggested actions (Retry/Reload/Log out & log in again), and ensure any rendered error details are passed through the redaction utility so secrets never appear."
        },
        {
          "path": "frontend/src/components/ErrorBoundary.tsx",
          "operation": "modify",
          "description": "Switch user-facing error boundary text that is touched by this fix to English and ensure technical details displayed (error/stack) are sanitized via the redaction utility to keep sensitive tokens out of the UI."
        }
      ]
    }
  ]
}