{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize card deletion flow and enable sale price editing in card editor",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make card deletion remove the card reliably from the gallery and keep UI/metrics stable by updating React Query cache and handling errors gracefully.",
      "acceptanceCriteria": [
        "Deleting a card from the card gallery removes it from the cards list after the mutation completes.",
        "No frontend error boundary screen, console uncaught exception, or backend trap is triggered during/after deletion for a valid card.",
        "After deletion, any portfolio statistics that depend on the user’s cards reflect the deletion without requiring a manual page refresh (e.g., totals, transaction summary/groups, sold-card balance)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden the delete-card mutation by adding an optimistic cache update (remove card from the cached userCards list immediately), cancel/invalidate relevant queries safely, and implement rollback on error so the UI never renders into an inconsistent state after deletion."
        },
        {
          "path": "frontend/src/components/CardItem.tsx",
          "operation": "modify",
          "description": "Adjust the delete confirmation flow to avoid UI instability during deletion (e.g., disable actions while pending, ensure dialogs close predictably, and avoid using stale card data after deletion) while relying on the improved mutation behavior."
        },
        {
          "path": "frontend/src/pages/PortfolioPage.tsx",
          "operation": "modify",
          "description": "Ensure portfolio metrics refresh seamlessly after card deletion by relying on the shared query keys and confirming the page remains resilient when lists/aggregates change rapidly (no render-time assumptions about deleted cards)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Extend the card edit dialog to allow editing an existing sale price and refresh portfolio metrics after saving.",
      "acceptanceCriteria": [
        "For cards with an existing salePrice, the edit dialog shows an editable sale price field prefilled with the current value.",
        "Saving edits persists the updated sale price in the backend (salePrice changes are reflected when reloading cards).",
        "After saving, the portfolio view reflects the updated sale price (e.g., total returns / sold-card balance) without requiring a manual refresh.",
        "For cards without an existing salePrice, the edit dialog does not show the sale price field (or clearly keeps it disabled/hidden)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EditCardDialog.tsx",
          "operation": "modify",
          "description": "Add a conditional sale price input that is shown only when card.salePrice is present, prefill it from the current value, validate edits, and on submit persist the change by invoking the existing sale price update capability in addition to the existing card field update."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the sale price update mutation integrates cleanly with the edit dialog flow (including consistent invalidation of userCards and portfolio metric queries) so changes are reflected across the app without manual refresh."
        },
        {
          "path": "frontend/src/components/CardItem.tsx",
          "operation": "modify",
          "description": "Ensure the card display updates correctly after an edited sale price is saved (including any sold/profit sections) by relying on refreshed query state and avoiding stale props assumptions."
        }
      ]
    }
  ]
}