{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Card editor cleanup and faster save/sell UX",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove Age/Version fields from the card edit dialog and ensure edits preserve stored age/version values.",
      "acceptanceCriteria": [
        "In the card edit dialog, there are no visible input controls labeled \"Age\" or \"Version\".",
        "The Save/Submit button validation does not depend on \"Age\" or \"Version\" being present or filled.",
        "Saving an edited card keeps the existing stored values for age and version unchanged (i.e., those properties are not cleared or overwritten unintentionally)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EditCardDialog.tsx",
          "operation": "modify",
          "description": "Remove the Age (Alter) and Version inputs and related local state; update submit logic to pass through the existing card.age and card.version values (so they remain unchanged), and adjust form validation so Save no longer depends on Age/Version."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make card \"Save\" feel faster by not blocking dialog close on sequential React Query invalidation/refetch work.",
      "acceptanceCriteria": [
        "After a successful update response from the backend, the edit dialog closes immediately (no delay caused by awaiting multiple query invalidations).",
        "Required data refreshes still happen in the background so the cards list/portfolio metrics update shortly after saving.",
        "No duplicate toasts or repeated refetch loops are introduced."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Refactor the update-card mutation success behavior to avoid awaiting multiple sequential query invalidations before the mutation resolves; trigger the same required refreshes in a non-blocking/background way (and keep toast behavior single-shot)."
        },
        {
          "path": "frontend/src/components/EditCardDialog.tsx",
          "operation": "modify",
          "description": "Ensure the edit dialog closes immediately after mutateAsync resolves (which should now correspond closely to backend success), without adding any extra invalidation waiting or duplicate success feedback in the component."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Make card \"Sell\" feel faster by not blocking dialog close on sequential React Query invalidation/refetch work.",
      "acceptanceCriteria": [
        "After a successful \"mark as sold\" response from the backend, the sell dialog closes immediately (no delay caused by awaiting multiple query invalidations).",
        "The cards list and relevant portfolio/sold-card views update shortly after selling without requiring a manual refresh.",
        "No regression in error handling (errors still show toasts and leave the dialog open)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Refactor the mark-as-sold mutation success behavior to avoid awaiting multiple sequential query invalidations before React Query calls component onSuccess; trigger the same refreshes in the background while preserving existing error/toast handling."
        },
        {
          "path": "frontend/src/components/SellOrTradeDialog.tsx",
          "operation": "modify",
          "description": "Verify/adjust sell success handling so the dialog closes immediately upon successful mutation completion, while keeping error handling unchanged and avoiding any new refetch loops or duplicate toasts."
        }
      ]
    }
  ]
}