{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Projekt zur Erweiterung einer Karten-Historie: Historie soll für alle Karten (auch bestehende) vollständige Ereignisse anzeigen und konkrete Feldänderungen (alt→neu) nachvollziehbar machen, inkl. Hinzufügen/Verkauf als letzte Aktion.",
  "architectural_notes": [
    "Historie sollte als Ereignis-/Audit-Log je Karte modelliert werden (z.B. events wie added/sold + field-diffs old/new).",
    "Für Karten, die vor Einführung der Historie existierten, wird ein Initial-/Backfill-Eintrag benötigt, damit Historie nicht leer ist."
  ],
  "known_issues": [
    "Aktuell werden nicht die Änderungen aller Karten in der Historie angezeigt (inkl. fehlender älterer Änderungen vor Feature-Einführung)."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-update-the-history-page-ui-copy-english-and-presentation-so-it-clearly-communicates-that-the-view-shows-add-sell-activity-and-is-correctly-refreshed-after-adding-or-selling-cards",
      "title": "Update the History page UI copy (English) and presentation so it clearly communicates that the view shows add/sell activity and is correctly refreshed after adding or selling cards.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Historie zeigt Änderungen für alle Karten, inkl. Änderungen vor Einführung der Historie (Backfill/Initial-History für bestehende Karten)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Historie zeigt pro Karten-Änderung detailliert was geändert wurde (alt→neu), z.B. Preisänderung",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Historie erfasst/zeigt Ereignisse 'Karte hinzugefügt' und 'Karte verkauft' und zeigt, welche der beiden Aktionen zuletzt passiert ist",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Backfill change history so that the History page can show an entry for (a) adding a card and (b) selling a card for ALL existing cards, including cards created/sold before the history feature existed. This must be persisted so the backfill does not re-add duplicate entries on subsequent requests.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Ensure history entries for adding and selling a card include a clear, user-readable summary that identifies the card (preferably including both card id and card name).",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-7",
      "summary": "If the backfill implementation introduces any new stable state fields (e.g., a per-user backfill marker), add/adjust the Motoko upgrade migration so existing canister state upgrades safely without data loss.",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Sorare Portfolio",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}